In [1]:
import pandas as pd
import numpy as np

In [3]:
mntnc_02=pd.read_excel('../Factors and Ridership Data/Maintenance/2002_vehicle_maintenance.xlsx')
mntnc_02.head()

,TRS_ID,MODE_CD,SERVICE_CD,MAJOR_FAILURE_NUM,OTHER_FAILURE_NUM,LABOR_HOURS_NUM
0,1,LR,DO,0.0,0.0,6766.0
1,1,MB,DO,10073.0,251.0,322242.0
2,1,TB,DO,811.0,114.0,57412.0
3,1,VP,DO,104.0,0.0,0.0
4,2,DR,DO,20.0,5.0,0.0

In [46]:
mntnc_03=pd.read_excel('../Factors and Ridership Data/Maintenance/2003_vehicle_maintenance.xlsx')
mntnc_04=pd.read_excel('../Factors and Ridership Data/Maintenance/2004_vehicle_maintenance.xlsx')
mntnc_05=pd.read_excel('../Factors and Ridership Data/Maintenance/2005_vehicle_maintenance.xlsx')
mntnc_06=pd.read_excel('../Factors and Ridership Data/Maintenance/2006_vehicle_maintenance.xlsx')
mntnc_07=pd.read_excel('../Factors and Ridership Data/Maintenance/2007_vehicle_maintenance.xlsx')
mntnc_08=pd.read_excel('../Factors and Ridership Data/Maintenance/2008_vehicle_maintenance.xlsx')
mntnc_09=pd.read_excel('../Factors and Ridership Data/Maintenance/2009_vehicle_maintenance.xlsx')
mntnc_10=pd.read_excel('../Factors and Ridership Data/Maintenance/2010_vehicle_maintenance.xlsx')
mntnc_11=pd.read_excel('../Factors and Ridership Data/Maintenance/2011_vehicle_maintenance.xlsx')
mntnc_12=pd.read_excel('../Factors and Ridership Data/Maintenance/2012_vehicle_maintenance.xlsx')
mntnc_13=pd.read_excel('../Factors and Ridership Data/Maintenance/2013_vehicle_maintenance.xlsx')
mntnc_14=pd.read_excel('../Factors and Ridership Data/Maintenance/2014_vehicle_maintenance.xlsx')
mntnc_15=pd.read_excel('../Factors and Ridership Data/Maintenance/2015_vehicle_maintenance.xlsx')
mntnc_16=pd.read_excel('../Factors and Ridership Data/Maintenance/2016_vehicle_maintenance.xlsx')
mntnc_17=pd.read_excel('../Factors and Ridership Data/Maintenance/2017_vehicle_maintenance.xlsx')
mntnc_18=pd.read_excel('../Factors and Ridership Data/Maintenance/2018_vehicle_maintenance.xlsx')

In [41]:
mntnc_07.head()

,Trs_Id,mode_cd,service_cd,mechanical_failures,other_failures,labor_hours_insp_maint
0,1,MB,DO,7208.0,4892.0,388031.0
1,1,TB,DO,1335.0,321.0,69946.0
2,1,VP,DO,87.0,0.0,0.0
3,2,DR,DO,14.0,3.0,17513.0
4,2,MB,DO,695.0,410.0,112815.0

In [17]:
mntnc_02=mntnc_02.rename(columns={'TRS_ID':'Trs_Id',
 'MODE_CD':'mode_cd',
 'SERVICE_CD':'service_cd',
 'MAJOR_FAILURE_NUM':'mechanical_failures',
 'OTHER_FAILURE_NUM':'other_failures',
 'LABOR_HOURS_NUM':'labor_hours_insp_maint'})

In [52]:
mntnc_02_mecha=mntnc_02[['Trs_Id','mode_cd','service_cd','mechanical_failures']]
mntnc_03_mecha=mntnc_03[['Trs_Id','mode_cd','service_cd','mechanical_failures']]
mntnc_04_mecha=mntnc_04[['Trs_Id','mode_cd','service_cd','mechanical_failures']]
mntnc_05_mecha=mntnc_05[['Trs_Id','mode_cd','service_cd','mechanical_failures']]
mntnc_06_mecha=mntnc_06[['Trs_Id','mode_cd','service_cd','mechanical_failures']]
mntnc_07_mecha=mntnc_07[['Trs_Id','mode_cd','service_cd','mechanical_failures']]
mntnc_08_mecha=mntnc_08[['Trs_Id','mode_cd','service_cd','mechanical_failures']]
mntnc_09_mecha=mntnc_09[['Trs_Id','mode_cd','service_cd','mechanical_failures']]
mntnc_10_mecha=mntnc_10[['Trs_Id','mode_cd','service_cd','mechanical_failures']]
mntnc_11_mecha=mntnc_11[['Trs_Id','mode_cd','service_cd','mechanical_failures']]
mntnc_02_mecha=mntnc_02_mecha.rename(columns={'mechanical_failures':'2002'})
mntnc_03_mecha=mntnc_03_mecha.rename(columns={'mechanical_failures':'2003'})
mntnc_04_mecha=mntnc_04_mecha.rename(columns={'mechanical_failures':'2004'})
mntnc_05_mecha=mntnc_05_mecha.rename(columns={'mechanical_failures':'2005'})
mntnc_06_mecha=mntnc_06_mecha.rename(columns={'mechanical_failures':'2006'})
mntnc_07_mecha=mntnc_07_mecha.rename(columns={'mechanical_failures':'2007'})
mntnc_08_mecha=mntnc_08_mecha.rename(columns={'mechanical_failures':'2008'})
mntnc_09_mecha=mntnc_09_mecha.rename(columns={'mechanical_failures':'2009'})
mntnc_10_mecha=mntnc_10_mecha.rename(columns={'mechanical_failures':'2010'})
mntnc_11_mecha=mntnc_11_mecha.rename(columns={'mechanical_failures':'2011'})
# mntnc_12_mecha=mntcn_02[['Trs_Id','mode_cd','service_cd','mechanical_failures_2002']]
# mntnc_13_mecha=mntcn_02[['Trs_Id','mode_cd','service_cd','mechanical_failures_2002']]
# mntnc_14_mecha=mntcn_02[['Trs_Id','mode_cd','service_cd','mechanical_failures_2002']]
# mntnc_15_mecha=mntcn_02[['Trs_Id','mode_cd','service_cd','mechanical_failures_2002']]
# mntnc_16_mecha=mntcn_02[['Trs_Id','mode_cd','service_cd','mechanical_failures_2002']]
# mntnc_17_mecha=mntcn_02[['Trs_Id','mode_cd','service_cd','mechanical_failures_2002']]
# mntnc_18_mecha=mntcn_02[['Trs_Id','mode_cd','service_cd','mechanical_failures_2002']]
mntnc_02_other=mntnc_02[['Trs_Id','mode_cd','service_cd','other_failures']]
mntnc_03_other=mntnc_03[['Trs_Id','mode_cd','service_cd','other_failures']]
mntnc_04_other=mntnc_04[['Trs_Id','mode_cd','service_cd','other_failures']]
mntnc_05_other=mntnc_05[['Trs_Id','mode_cd','service_cd','other_failures']]
mntnc_06_other=mntnc_06[['Trs_Id','mode_cd','service_cd','other_failures']]
mntnc_07_other=mntnc_07[['Trs_Id','mode_cd','service_cd','other_failures']]
mntnc_08_other=mntnc_08[['Trs_Id','mode_cd','service_cd','other_failures']]
mntnc_09_other=mntnc_09[['Trs_Id','mode_cd','service_cd','other_failures']]
mntnc_10_other=mntnc_10[['Trs_Id','mode_cd','service_cd','other_failures']]
mntnc_11_other=mntnc_11[['Trs_Id','mode_cd','service_cd','other_failures']]
mntnc_02_other=mntnc_02_other.rename(columns={'other_failures':'2002'})
mntnc_03_other=mntnc_03_other.rename(columns={'other_failures':'2003'})
mntnc_04_other=mntnc_04_other.rename(columns={'other_failures':'2004'})
mntnc_05_other=mntnc_05_other.rename(columns={'other_failures':'2005'})
mntnc_06_other=mntnc_06_other.rename(columns={'other_failures':'2006'})
mntnc_07_other=mntnc_07_other.rename(columns={'other_failures':'2007'})
mntnc_08_other=mntnc_08_other.rename(columns={'other_failures':'2008'})
mntnc_09_other=mntnc_09_other.rename(columns={'other_failures':'2009'})
mntnc_10_other=mntnc_10_other.rename(columns={'other_failures':'2010'})
mntnc_11_other=mntnc_11_other.rename(columns={'other_failures':'2011'})

In [53]:
mntnc_02_03_mecha=pd.merge(mntnc_02_mecha,mntnc_03_mecha,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')
mntnc_02_03_other=pd.merge(mntnc_02_other,mntnc_03_other,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')
mntnc_02_03_other.head()

   Trs_Id mode_cd service_cd   2002   2003
0       1      LR         DO    0.0    0.0
1       1      MB         DO  251.0  136.0
2       1      TB         DO  114.0   81.0
3       1      VP         DO    0.0    0.0
4       2      DR         DO    5.0    1.0

In [54]:
mntnc_02_04_mecha=pd.merge(mntnc_02_03_mecha,mntnc_04_mecha,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')
mntnc_02_04_other=pd.merge(mntnc_02_03_other,mntnc_04_other,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')

In [55]:
mntnc_02_05_mecha=pd.merge(mntnc_02_04_mecha,mntnc_05_mecha,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')
mntnc_02_05_other=pd.merge(mntnc_02_04_other,mntnc_05_other,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')

In [56]:
mntnc_02_06_mecha=pd.merge(mntnc_02_05_mecha,mntnc_06_mecha,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')
mntnc_02_06_other=pd.merge(mntnc_02_05_other,mntnc_06_other,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')

In [57]:
mntnc_02_07_mecha=pd.merge(mntnc_02_06_mecha,mntnc_07_mecha,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')
mntnc_02_07_other=pd.merge(mntnc_02_06_other,mntnc_07_other,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')

In [58]:
mntnc_02_08_mecha=pd.merge(mntnc_02_07_mecha,mntnc_08_mecha,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')
mntnc_02_08_other=pd.merge(mntnc_02_07_other,mntnc_08_other,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')

In [59]:
mntnc_02_09_mecha=pd.merge(mntnc_02_08_mecha,mntnc_09_mecha,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')
mntnc_02_09_other=pd.merge(mntnc_02_08_other,mntnc_09_other,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')

In [60]:
mntnc_02_10_mecha=pd.merge(mntnc_02_09_mecha,mntnc_10_mecha,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')
mntnc_02_10_other=pd.merge(mntnc_02_09_other,mntnc_10_other,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')

In [62]:
mntnc_02_11_mecha=pd.merge(mntnc_02_10_mecha,mntnc_11_mecha,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')
mntnc_02_11_other=pd.merge(mntnc_02_10_other,mntnc_11_other,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')

In [67]:
mntnc_02_11_mecha.head()

,Trs_Id,mode_cd,service_cd,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011
0,1,LR,DO,0.0,0.0,0.0,2.0,NaN,NaN,6,3,2,NaN
1,1,MB,DO,10073.0,1113.0,1066.0,912.0,7429.0,7208.0,6903,7170,6233,6743
2,1,TB,DO,811.0,800.0,910.0,773.0,2128.0,1335.0,996,823,1568,1881
3,1,VP,DO,104.0,30.0,62.0,101.0,128.0,87.0,95,110,63,77
4,2,DR,DO,20.0,3.0,9.0,8.0,5.0,14.0,29,27,37,35

In [79]:
mntnc_13.head()

,NTDID,Agency Name,SSW,Mode,TOS,Major mechanical system failures,Other mechanical system failures,Total Revenue Vehicle System Failures
0,1,King County Department of Transportation - Met...,N,DR,PT,26.0,204.0,230
1,1,King County Department of Transportation - Met...,N,MB,DO,6718.0,7019.0,13737
2,1,King County Department of Transportation - Met...,N,MB,PT,33.0,20.0,53
3,1,King County Department of Transportation - Met...,N,SR,DO,5.0,7.0,12
4,1,King County Department of Transportation - Met...,N,TB,DO,2070.0,1838.0,3908

In [103]:
list(mntnc_12)

['Trs_Id',
 'Company_Nm',
 'Mode_Cd',
 'Service_Cd',
 'Major_Failure_Num',
 'Other_Failure_Num',
 'Total_Failures']

In [106]:
mntnc_12_mecha=mntnc_12[['Trs_Id','Mode_Cd','Service_Cd','Major_Failure_Num']]
mntnc_12_mecha=mntnc_12_mecha.rename(columns={'Mode_Cd':'mode_cd','Service_Cd':'service_cd','Major_Failure_Num':'2012'})
mntnc_12_other=mntnc_12[['Trs_Id','Mode_Cd','Service_Cd','Other_Failure_Num']]
mntnc_12_other=mntnc_12_other.rename(columns={'Mode_Cd':'mode_cd','Service_Cd':'service_cd','Other_Failure_Num':'2012'})

mntnc_13_mecha=mntnc_13[['NTDID','Mode','TOS','Major mechanical system failures']]
mntnc_13_mecha=mntnc_13_mecha.rename(columns={'NTDID':'Trs_Id',
                                              'Mode':'mode_cd',
                                              'TOS':'service_cd',
                                              'Major mechanical system failures':'2013'})
mntnc_13_other=mntnc_13[['NTDID','Mode','TOS','Other mechanical system failures']]
mntnc_13_other=mntnc_13_other.rename(columns={'NTDID':'Trs_Id',
                                              'Mode':'mode_cd',
                                              'TOS':'service_cd',
                                              'Other mechanical system failures':'2013'})

In [92]:
mntnc_14=mntnc_14[mntnc_14['4 Digit NTDID'].notnull()]
mntnc_14=mntnc_14[mntnc_14['4 Digit NTDID']!='3R04-012']
mntnc_14['4 Digit NTDID']=mntnc_14['4 Digit NTDID'].astype(int)

In [89]:
mntnc_14=pd.read_excel('../Factors and Ridership Data/Maintenance/2014_vehicle_maintenance.xlsx')
mntnc_15=pd.read_excel('../Factors and Ridership Data/Maintenance/2015_vehicle_maintenance.xlsx')
mntnc_16=pd.read_excel('../Factors and Ridership Data/Maintenance/2016_vehicle_maintenance.xlsx')
mntnc_17=pd.read_excel('../Factors and Ridership Data/Maintenance/2017_vehicle_maintenance.xlsx')
mntnc_18=pd.read_excel('../Factors and Ridership Data/Maintenance/2018_vehicle_maintenance.xlsx')

In [97]:
mntnc_18.head()

,NTD ID,Legacy NTD ID,Agency Name,Reporter Type,Reporting Module,Mode,TOS,Major Failures,Other Failures,Total Failures
0,1,1,King County Department of Metro Transit,Full Reporter,Urban,DR,PT,87,16,103
1,1,1,King County Department of Metro Transit,Full Reporter,Urban,FB,DO,6,0,6
2,1,1,King County Department of Metro Transit,Full Reporter,Urban,MB,DO,7799,8905,16704
3,1,1,King County Department of Metro Transit,Full Reporter,Urban,MB,PT,32,82,114
4,1,1,King County Department of Metro Transit,Full Reporter,Urban,SR,DO,17,26,43

In [98]:
mntnc_14_mecha=mntnc_14[['4 Digit NTDID','Mode','TOS','Major mechanical system failures']]
mntnc_14_mecha=mntnc_14_mecha.rename(columns={'4 Digit NTDID':'Trs_Id',
                                              'Mode':'mode_cd',
                                              'TOS':'service_cd',
                                              'Major mechanical system failures':'2014'})
mntnc_14_other=mntnc_14[['4 Digit NTDID','Mode','TOS','Other mechanical system failures']]
mntnc_14_other=mntnc_14_other.rename(columns={'4 Digit NTDID':'Trs_Id',
                                              'Mode':'mode_cd',
                                              'TOS':'service_cd',
                                              'Other mechanical system failures':'2014'})

mntnc_15_mecha=mntnc_15[['Legacy NTD ID','Mode','TOS','Major Failures']]
mntnc_15_mecha=mntnc_15_mecha.rename(columns={'Legacy NTD ID':'Trs_Id',
                                              'Mode':'mode_cd',
                                              'TOS':'service_cd',
                                              'Major Failures':'2015'})
mntnc_15_other=mntnc_15[['Legacy NTD ID','Mode','TOS','Other Failures']]
mntnc_15_other=mntnc_15_other.rename(columns={'Legacy NTD ID':'Trs_Id',
                                              'Mode':'mode_cd',
                                              'TOS':'service_cd',
                                              'Other Failures':'2015'})

mntnc_16_mecha=mntnc_16[['Legacy NTD ID','Mode','TOS','Major Failures']]
mntnc_16_mecha=mntnc_16_mecha.rename(columns={'Legacy NTD ID':'Trs_Id',
                                              'Mode':'mode_cd',
                                              'TOS':'service_cd',
                                              'Major Failures':'2016'})
mntnc_16_other=mntnc_16[['Legacy NTD ID','Mode','TOS','Other Failures']]
mntnc_16_other=mntnc_16_other.rename(columns={'Legacy NTD ID':'Trs_Id',
                                              'Mode':'mode_cd',
                                              'TOS':'service_cd',
                                              'Other Failures':'2016'})

mntnc_17_mecha=mntnc_17[['Legacy NTD ID','Mode','TOS','Major Failures']]
mntnc_17_mecha=mntnc_17_mecha.rename(columns={'Legacy NTD ID':'Trs_Id',
                                              'Mode':'mode_cd',
                                              'TOS':'service_cd',
                                              'Major Failures':'2017'})
mntnc_17_other=mntnc_17[['Legacy NTD ID','Mode','TOS','Other Failures']]
mntnc_17_other=mntnc_17_other.rename(columns={'Legacy NTD ID':'Trs_Id',
                                              'Mode':'mode_cd',
                                              'TOS':'service_cd',
                                              'Other Failures':'2017'})

mntnc_18_mecha=mntnc_18[['Legacy NTD ID','Mode','TOS','Major Failures']]
mntnc_18_mecha=mntnc_18_mecha.rename(columns={'Legacy NTD ID':'Trs_Id',
                                              'Mode':'mode_cd',
                                              'TOS':'service_cd',
                                              'Major Failures':'2018'})
mntnc_18_other=mntnc_18[['Legacy NTD ID','Mode','TOS','Other Failures']]
mntnc_18_other=mntnc_18_other.rename(columns={'Legacy NTD ID':'Trs_Id',
                                              'Mode':'mode_cd',
                                              'TOS':'service_cd',
                                              'Other Failures':'2018'})

In [107]:
mntnc_02_12_mecha=pd.merge(mntnc_02_11_mecha,mntnc_12_mecha,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')
mntnc_02_12_other=pd.merge(mntnc_02_11_other,mntnc_12_other,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')

In [108]:
mntnc_02_13_mecha=pd.merge(mntnc_02_12_mecha,mntnc_13_mecha,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')
mntnc_02_13_other=pd.merge(mntnc_02_12_other,mntnc_13_other,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')

In [109]:
mntnc_02_14_mecha=pd.merge(mntnc_02_13_mecha,mntnc_14_mecha,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')
mntnc_02_14_other=pd.merge(mntnc_02_13_other,mntnc_14_other,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')

In [110]:
mntnc_02_15_mecha=pd.merge(mntnc_02_14_mecha,mntnc_15_mecha,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')
mntnc_02_15_other=pd.merge(mntnc_02_14_other,mntnc_15_other,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')

In [111]:
mntnc_02_16_mecha=pd.merge(mntnc_02_15_mecha,mntnc_16_mecha,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')
mntnc_02_16_other=pd.merge(mntnc_02_15_other,mntnc_16_other,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')

In [112]:
mntnc_02_17_mecha=pd.merge(mntnc_02_16_mecha,mntnc_17_mecha,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')
mntnc_02_17_other=pd.merge(mntnc_02_16_other,mntnc_17_other,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')

In [113]:
mntnc_02_18_mecha=pd.merge(mntnc_02_17_mecha,mntnc_18_mecha,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')
mntnc_02_18_other=pd.merge(mntnc_02_17_other,mntnc_18_other,on=['Trs_Id','mode_cd','service_cd'],
                     how='outer')

In [115]:
mntnc_02_18_other.head()

,Trs_Id,mode_cd,service_cd,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018
0,1,LR,DO,0.0,0.0,0.0,0.0,NaN,NaN,1,3,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1,MB,DO,251.0,136.0,98.0,84.0,5374.0,4892.0,4998,4822,6762,7707,8052.0,7019.0,6423.0,6765.0,7328.0,8821.0,8905.0
2,1,TB,DO,114.0,81.0,57.0,67.0,609.0,321.0,275,252,1631,2146,1937.0,1838.0,2026.0,1997.0,2021.0,1818.0,1717.0
3,1,VP,DO,0.0,0.0,0.0,0.0,0.0,0.0,0,,,0,NaN,0.0,0.0,0.0,0.0,0.0,0.0
4,2,DR,DO,5.0,1.0,3.0,6.0,2.0,3.0,5,8,9,5,4.0,5.0,4.0,8.0,6.0,6.0,9.0

In [116]:
rail=['AG','CC','CR','HR','LR','IP','MO','RL','RP','RS','SR','VT','MG']
bus=['MB','RB','CB','TB']
dr = ['DT','JT','VP','DR','PB']
other=['TR','FB']
def railbus(df):
    if df['mode_cd'] in rail:
        return 'Rail'
    elif df['mode_cd'] in bus:
        return 'Bus'
    elif df['mode_cd'] in dr:
        return 'DemandResponse'
    else:
        return "Other"

In [117]:
mntnc_02_18_mecha['MODE']=mntnc_02_18_mecha.apply(railbus,axis=1)
mntnc_02_18_other['MODE']=mntnc_02_18_other.apply(railbus,axis=1)
#fare_1415['NTD_ID']=fare_1415.apply(blank_ntd,axis=1)

In [118]:
mntnc_02_18_mecha.head()

,Trs_Id,mode_cd,service_cd,2002,2003,2004,2005,2006,2007,2008,...,2010,2011,2012,2013,2014,2015,2016,2017,2018,MODE
0,1,LR,DO,0.0,0.0,0.0,2.0,NaN,NaN,6,...,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Rail
1,1,MB,DO,10073.0,1113.0,1066.0,912.0,7429.0,7208.0,6903,...,6233,6743,7431.0,6718.0,6064.0,6557.0,6998.0,8217.0,7799.0,Bus
2,1,TB,DO,811.0,800.0,910.0,773.0,2128.0,1335.0,996,...,1568,1881,1935.0,2070.0,2065.0,1988.0,2165.0,1575.0,1502.0,Bus
3,1,VP,DO,104.0,30.0,62.0,101.0,128.0,87.0,95,...,63,77,69.0,48.0,63.0,52.0,34.0,44.0,48.0,DemandResponse
4,2,DR,DO,20.0,3.0,9.0,8.0,5.0,14.0,29,...,37,35,38.0,40.0,17.0,14.0,13.0,17.0,25.0,DemandResponse

In [119]:
mntnc_02_18_mecha.to_csv('../Factors and Ridership Data/Final Datasets/maintenance_mecha_failures.csv')

In [135]:
mntnc_02_18_mecha=pd.read_csv('../Factors and Ridership Data/Final Datasets/maintenance_mecha_failures.csv')
mntnc_02_18_other=pd.read_csv('../Factors and Ridership Data/Final Datasets/maintenance_other_failures.csv')

In [120]:
mntnc_02_18_other.to_csv('../Factors and Ridership Data/Final Datasets/maintenance_other_failures.csv')

In [136]:
mntnc_02_18_mecha=mntnc_02_18_mecha[(mntnc_02_18_mecha['MODE']!='DemandResponse')&(mntnc_02_18_mecha['MODE']!='Other')]

In [226]:
mntnc_02_18_other['2008'].unique()

array(['1', '4998', '275', '367', '933', '63', '3', '282', '48', '147',
       '277', '86', '9', '8', '278', '20', '59', '30', '10', '46', nan,
       '41', '2024', '27', '32', '332', '2', '45', '613', '115', '133',
       '235', '2147', '340', '18', '1296', '407', '112', '174', '50', '0',
       '165', '544', '36', '3272', '6', '747', '8208', '3571', '38',
       '189', '11', '55', '251', '3125', '5', '492', '                 ',
       '705', '241', '205', '21', '240', '178', '53', '64', '201', '83',
       '150', '42', '12', '1113', '454', '88', '710', '218', '468', '77',
       '263', '231', '430', '105', '106', '1297', '3758', '29', '80',
       '444', '391', '186', '339', '362', '1631', '164', '23', '1829',
       '352', '92', '149', '126', '128', '1088', '284', '378', '2660',
       '715', '71', '111', '10684', '28', '99', '82', '109', '371',
       '1118', '97', '1834', '169', '210', '445', '168', '906', '193',
       '347', '131', '167', '388', '298', '6808', '242', '52', '271',
       '534', '217', '238', '136', '368', '4', '67', '43', '185', '33',
       '4621', '144', '221', '199', '34', '177', '84', '31', '58', '3810',
       '1390', '184', '924', '37', '15', '127', '455', '1238', '429',
       '1010', '16', '8836', '14', '345', '296', '865', '13', '435',
       '213', '156', '600', '51', '330', '303', '93', '7', '577', '439',
       '20947', '8290', '44', '249', '17', '96', '510', '6306', '35',
       '172', '181', '166', '693', '3561', '2000', '22', '19', '267',
       '1554', '25', '1068', '420', '635', '639', '49', '2059', '1215',
       '176', '250', '335', '356', '68', '180', '24', '293', '505', '108',
       '191', '95', '530', '85', '155', '26', '113', '398', '78', '329',
       '202', '961', '175', '387', '651', '1931', '3618', '2227', '3539',
       '89', '74', '268', '597', '2115', '826', '272', '103', '219', '57',
       '18397', '91', '40', '47', '183', '102', '39', '87', '414', '6595',
       '369', '2144', '246', '196', '182', '162', '124', '120', '273',
       '294', '495', '3040', '618', '65', '258'], dtype=object)

In [227]:
mntnc_02_18_other=mntnc_02_18_other.replace('                ',0)
mntnc_02_18_other=mntnc_02_18_other.replace('                 ',0)

In [228]:
mntnc_02_18_mecha=mntnc_02_18_mecha.fillna(0)
mntnc_02_18_mecha['2008']=mntnc_02_18_mecha['2008'].astype(float)
mntnc_02_18_mecha['2009']=mntnc_02_18_mecha['2009'].astype(float)
mntnc_02_18_mecha['2010']=mntnc_02_18_mecha['2010'].astype(float)
mntnc_02_18_mecha['2011']=mntnc_02_18_mecha['2011'].astype(float)


mntnc_02_18_other=mntnc_02_18_other.fillna(0)
mntnc_02_18_other['2008']=mntnc_02_18_other['2008'].astype(float)
mntnc_02_18_other['2009']=mntnc_02_18_other['2009'].astype(float)
mntnc_02_18_other['2010']=mntnc_02_18_other['2010'].astype(float)
mntnc_02_18_other['2011']=mntnc_02_18_other['2011'].astype(float)

In [229]:
mntnc_02_18_other=mntnc_02_18_other[(mntnc_02_18_other['MODE']!='DemandResponse')&(mntnc_02_18_other['MODE']!='Other')]

In [230]:
mecha_failures=mntnc_02_18_mecha.groupby(by=['Trs_Id','MODE']).sum().reset_index()
#mecha_failures=mntnc_02_18_mecha_test.groupby(by=['Trs_Id','MODE']).sum().reset_index()

In [232]:
mntnc_02_18_mecha.dtypes

Unnamed: 0      int64
Trs_Id          int64
mode_cd        object
service_cd     object
2002          float64
2003          float64
2004          float64
2005          float64
2006          float64
2007          float64
2008          float64
2009          float64
2010          float64
2011          float64
2012          float64
2013          float64
2014          float64
2015          float64
2016          float64
2017          float64
2018          float64
MODE           object
dtype: object

In [233]:
other_failures=mntnc_02_18_other.groupby(by=['Trs_Id','MODE']).sum().reset_index()

In [234]:

mecha_failures.drop(columns=['Unnamed: 0'],inplace=True)
mecha_failures.head()

,Trs_Id,MODE,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018
0,1,Bus,10884.0,1913.0,1976.0,1685.0,9557.0,8543.0,7899.0,8005.0,7824.0,8752.0,9389.0,8821.0,8225.0,8588.0,9188.0,9819.0,9333.0
1,1,Rail,0.0,0.0,0.0,2.0,0.0,0.0,6.0,3.0,2.0,4.0,2.0,5.0,4.0,3.0,38.0,18.0,17.0
2,2,Bus,951.0,991.0,958.0,733.0,731.0,695.0,565.0,544.0,566.0,570.0,622.0,612.0,647.0,645.0,707.0,691.0,689.0
3,3,Bus,289.0,203.0,188.0,85.0,565.0,465.0,907.0,997.0,863.0,342.0,337.0,899.0,731.0,573.0,620.0,642.0,609.0
4,5,Bus,88.0,55.0,33.0,30.0,60.0,80.0,66.0,85.0,59.0,66.0,80.0,142.0,101.0,112.0,128.0,123.0,130.0

In [235]:
other_failures.drop(columns=['Unnamed: 0'],inplace=True)
other_failures.head()

,Trs_Id,MODE,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018
0,1,Bus,365.0,217.0,155.0,151.0,5983.0,5213.0,5273.0,5092.0,8452.0,10371.0,10030.0,8877.0,8519.0,8831.0,9405.0,10703.0,10704.0
1,1,Rail,0.0,0.0,0.0,0.0,0.0,0.0,1.0,3.0,4.0,6.0,3.0,7.0,2.0,10.0,74.0,55.0,26.0
2,2,Bus,623.0,665.0,517.0,505.0,377.0,410.0,367.0,347.0,223.0,197.0,224.0,179.0,258.0,199.0,145.0,317.0,341.0
3,3,Bus,228.0,231.0,137.0,83.0,240.0,307.0,933.0,900.0,1060.0,1336.0,1872.0,492.0,467.0,1099.0,761.0,603.0,446.0
4,5,Bus,58.0,50.0,29.0,16.0,22.0,50.0,63.0,98.0,80.0,132.0,50.0,23.0,24.0,32.0,43.0,32.0,39.0

In [155]:
agency_uza=pd.read_csv('../Factors and Ridership Data/Maintenance/agency_uza.csv',encoding='utf-8')
agency_uza.head()

,5 digit NTD ID,4 digit NTD ID,Agency,HQ City,HQ State,UZA,UZA Name,UZA Area SQ Miles,UZA Population,Service Area SQ Miles,Service Area Population
0,1,1,King County Department of Transportation - Met...,Seattle,WA,14,"Seattle, WA","1,010","3,059,393","2,134","2,117,125"
1,2,2,Spokane Transit Authority,Spokane,WA,96,"Spokane, WA",164,"387,847",248,"409,271"
2,3,3,Pierce County Transportation Benefit Area Auth...,Tacoma,WA,14,"Seattle, WA","1,010","3,059,393",292,"547,975"
3,5,5,Everett Transit,Everett,WA,14,"Seattle, WA","1,010","3,059,393",34,"106,736"
4,6,6,Yakima Transit,Yakima,WA,248,"Yakima, WA",60,"129,534",33,"100,715"

In [156]:
agency_uza=agency_uza[['4 digit NTD ID','UZA']]
agency_uza=agency_uza.rename(columns={'4 digit NTD ID':'NTD_ID'})
agency_uza.head()

   NTD_ID  UZA
0       1   14
1       2   96
2       3   14
3       5   14
4       6  248

In [157]:
agency_uza['NTD_ID']=agency_uza['NTD_ID'].astype(int)

In [236]:
mecha_failures_agency=pd.merge(agency_uza,mecha_failures,left_on=['NTD_ID'],right_on=['Trs_Id'],how='inner')

In [237]:
mecha_failures_agency.drop(columns=['Trs_Id'],inplace=True)
mecha_failures_agency.head()

,NTD_ID,UZA,MODE,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018
0,1,14,Bus,10884.0,1913.0,1976.0,1685.0,9557.0,8543.0,7899.0,8005.0,7824.0,8752.0,9389.0,8821.0,8225.0,8588.0,9188.0,9819.0,9333.0
1,1,14,Rail,0.0,0.0,0.0,2.0,0.0,0.0,6.0,3.0,2.0,4.0,2.0,5.0,4.0,3.0,38.0,18.0,17.0
2,2,96,Bus,951.0,991.0,958.0,733.0,731.0,695.0,565.0,544.0,566.0,570.0,622.0,612.0,647.0,645.0,707.0,691.0,689.0
3,3,14,Bus,289.0,203.0,188.0,85.0,565.0,465.0,907.0,997.0,863.0,342.0,337.0,899.0,731.0,573.0,620.0,642.0,609.0
4,5,14,Bus,88.0,55.0,33.0,30.0,60.0,80.0,66.0,85.0,59.0,66.0,80.0,142.0,101.0,112.0,128.0,123.0,130.0

In [238]:
mecha_grouped=mecha_failures_agency.groupby(by=['UZA','MODE']).sum().reset_index()
mecha_grouped.drop(columns=['NTD_ID'],inplace=True)

In [239]:
other_failures_agency=pd.merge(agency_uza,other_failures,left_on=['NTD_ID'],right_on=['Trs_Id'],how='inner')

In [240]:
other_failures_agency.drop(columns=['Trs_Id','NTD_ID'],inplace=True)
other_grouped=other_failures_agency.groupby(by=['UZA','MODE']).sum().reset_index()

In [241]:
other_grouped.head()

,UZA,MODE,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018
0,0,Bus,168.0,177.0,364.0,504.0,1047.0,1110.0,92.0,33.0,1134.0,1059.0,21.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0,Rail,0.0,0.0,25.0,62.0,166.0,157.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,1,Bus,19167.0,13121.0,12868.0,11796.0,13344.0,16213.0,16221.0,15519.0,16358.0,16713.0,16552.0,16106.0,17012.0,17430.0,17097.0,16078.0,14212.0
3,1,Rail,7923.0,6065.0,6412.0,6486.0,7828.0,8419.0,8960.0,8362.0,8104.0,7773.0,8112.0,8648.0,10546.0,10476.0,10302.0,11054.0,12746.0
4,2,Bus,4380.0,4496.0,6683.0,7188.0,23365.0,23365.0,21877.0,28263.0,25028.0,23120.0,21664.0,21229.0,19448.0,17312.0,16784.0,15596.0,16323.0

In [242]:
other_grouped=other_grouped[other_grouped['UZA']!=0]
mecha_grouped=mecha_grouped[mecha_grouped['UZA']!=0]

In [243]:
mecha_final=pd.melt(mecha_grouped, id_vars=list(mecha_grouped)[0:2], value_vars=list(mecha_grouped)[2:],var_name='Year',
       value_name='Mechanical_Failures')
other_final=pd.melt(other_grouped, id_vars=list(other_grouped)[0:2], value_vars=list(other_grouped)[2:],var_name='Year',
       value_name='Other_Failures')

In [244]:
other_final.head()

   UZA  MODE  Year  Other_Failures
0    1   Bus  2002         19167.0
1    1  Rail  2002          7923.0
2    2   Bus  2002          4380.0
3    2  Rail  2002          1925.0
4    3   Bus  2002          1943.0

In [245]:
combined=pd.merge(mecha_final,other_final,on=['UZA','MODE','Year'])

In [246]:
combined['Total_Failures']=combined['Mechanical_Failures']+combined['Other_Failures']
combined.head()

   UZA  MODE  Year  Mechanical_Failures  Other_Failures  Total_Failures
0    1   Bus  2002              29724.0         19167.0         48891.0
1    1  Rail  2002               4740.0          7923.0         12663.0
2    2   Bus  2002              25984.0          4380.0         30364.0
3    2  Rail  2002               1941.0          1925.0          3866.0
4    3   Bus  2002              19614.0          1943.0         21557.0

In [190]:
uza_msa=pd.read_csv('../Factors and Ridership Data/Final Datasets/fare_by_CBSA.csv')
uza_msa.head()

,Unnamed: 0,UZA Name,UZA,CBSA,MNAME,RailBus,Year,UPT,VRM,FARE,UAPOPPCT
0,18,"New York-Newark, NY-NJ-CT",1,35620.0,"New York-Northern New Jersey-Long Island, NY-N...",Bus,2002,1.184686e+09,230468045.0,9.079534e+08,99.71
1,19,"New York-Newark, NY-NJ-CT",1,35620.0,"New York-Northern New Jersey-Long Island, NY-N...",Bus,2003,1.139943e+09,211497446.0,1.021682e+09,99.71
2,20,"New York-Newark, NY-NJ-CT",1,35620.0,"New York-Northern New Jersey-Long Island, NY-N...",Bus,2004,1.151770e+09,232499089.0,1.126283e+09,99.71
3,21,"New York-Newark, NY-NJ-CT",1,35620.0,"New York-Northern New Jersey-Long Island, NY-N...",Bus,2005,1.219800e+09,238327711.0,1.135691e+09,99.71
4,22,"New York-Newark, NY-NJ-CT",1,35620.0,"New York-Northern New Jersey-Long Island, NY-N...",Bus,2006,1.178676e+09,233233183.0,2.683906e+09,99.71

In [192]:
uza_msa=uza_msa[['UZA','CBSA']]
uza_msa=uza_msa.drop_duplicates()
uza_msa.head()

     UZA     CBSA
0      1  35620.0
34     2  31100.0
68     3  16980.0
102    4  33100.0
136    5  37980.0

In [247]:
final=pd.merge(combined,uza_msa,on=['UZA']).groupby(by=['CBSA','MODE','Year']).sum().reset_index()

In [253]:
final=final.rename(columns={'MODE':'Mode'})

In [255]:
final.to_csv('../Factors and Ridership Data/Estimation_File/maintenance_final.csv')
final.to_csv('../Factors and Ridership Data/Model Estimation/Est8/maintenance_final.csv')

In [254]:
final.head()

      CBSA Mode  Year  Mechanical_Failures  Other_Failures  Total_Failures
0  10180.0  Bus  2002                  1.0            29.0            30.0
1  10180.0  Bus  2003                 10.0            23.0            33.0
2  10180.0  Bus  2004                  7.0            22.0            29.0
3  10180.0  Bus  2005                  9.0            23.0            32.0
4  10180.0  Bus  2006                 12.0            43.0            55.0

In [252]:
final.Year.unique()

array(['2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009',
       '2010', '2011', '2012', '2013', '2014', '2015', '2016', '2017',
       '2018'], dtype=object)